; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	spectrograph1 - mode
	infrared0 - mode
	infrared7 - mode
	infrared6 - mode
	thermograph9 - mode
	spectrograph4 - mode
	infrared8 - mode
	spectrograph3 - mode
	thermograph10 - mode
	infrared5 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation3 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared6)
	(supports instrument0 thermograph10)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared8)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph9)
	(supports instrument0 infrared7)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Planet7 infrared7)
	(have_image Planet7 infrared0)
	(have_image Planet7 spectrograph3)
	(have_image Planet8 infrared5)
	(have_image Planet8 image2)
	(have_image Star9 spectrograph1)
	(have_image Star10 infrared5)
	(have_image Star10 thermograph10)
	(have_image Star10 infrared8)
	(have_image Star11 thermograph9)
	(have_image Star11 infrared5)
	(have_image Star11 spectrograph3)
))

)

; plan
1. (turn_to satellite0 groundstation3 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 star9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star9)
   goals met: 0 of 12
5. (take_image satellite0 star9 instrument0 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 1 of 12
6. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 12
7. (take_image satellite0 star10 instrument0 thermograph10)
   added: (have_image star10 thermograph10)
   goals met: 2 of 12
8. (take_image satellite0 star10 instrument0 infrared8)
   added: (have_image star10 infrared8)
   goals met: 3 of 12
9. (take_image satellite0 star10 instrument0 infrared5)
   added: (have_image star10 infrared5)
   goals met: 4 of 12
10. (turn_to satellite0 planet7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet7)
   goals met: 4 of 12
11. (take_image satellite0 planet7 instrument0 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 5 of 12
12. (take_image satellite0 planet7 instrument0 infrared7)
   added: (have_image planet7 infrared7)
   goals met: 6 of 12
13. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 7 of 12
14. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
15. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 8 of 12
16. (take_image satellite0 planet8 instrument0 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 9 of 12
17. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 9 of 12
18. (take_image satellite0 star11 instrument0 infrared5)
   added: (have_image star11 infrared5)
   goals met: 10 of 12
19. (take_image satellite0 star11 instrument0 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 11 of 12
20. (take_image satellite0 star11 instrument0 thermograph9)
   added: (have_image star11 thermograph9)
   goals met: 12 of 12
